<script setup>

</script>

<template>
  <h1 class="mt-5">Урок: «Vue router»</h1>
  <h2>Домашнее задание</h2>
  <p>Реализовать рутинг в приложении</p>
  <h4>Цель:</h4>
  <p>Научится применять рутинг в приложении</p>
  <p>Какие скиллы тренируем в ДЗ: Vue router, взаимодействие компонентов и рутера, программная навигация, компонент
    router-link</p>
  <h4>Описание/Пошаговая инструкция выполнения домашнего задания:</h4>
  <ul>
    <li>У Вас уже создан репозиторий на Github и проект с использованием Vue+Vite</li>
    <li>Проект на vue с использованием Vite;</li>
    <li>Страницы со списком сущностей (книг/авторов)</li>
    <li>Страницы с добавлением сущностей (книг/авторов)</li>
    <li>добавить рутер
      <ul>
        <p class="mt-1 mb-1">Реализовать рутин</p>
        <li>главная страница</li>
        <li>страница со списком книг</li>
        <li>страница со списком авторов</li>
        <li>страница добавления книги</li>
        <li>страница добавления авторов</li>
        <p class="mt-1 mb-1">Реализовать переходы:</p>
        <li>с главной страницы на страницы со списком</li>
        <li>со страницы со списком на страницы-формы</li>
        <li>из форм обратно на страницы списков</li>
        <p class="mt-1 mb-1">Прочий функционал:</p>
        <li>страницы-редакторы книг и авторов, переходы к ним из списка, возвращение на страницы списков</li>
      </ul>
    </li>
  </ul>

</template>

<style scoped>

</style>