<script setup>

</script>

<template>
  <h1 class="mt-5">Урок: «Формы, слоты, фильтры, директивы»</h1>
  <h2>Домашнее задание</h2>
  <p>Реализовать несколько форм и списков</p>
  <h4>Цель:</h4>
  <p>Научится создавать формы и работать с данными в приложении</p>
  <p>Какие скиллы тренируем в ДЗ: работа с формами, передача данных между компонентами</p>
  <h4>Описание/Пошаговая инструкция выполнения домашнего задания:</h4>
  <ul>
    <li>У Вас уже создан репозиторий на Github и проект с использованием Vue+Vite</li>
    <li>Определитесь с типом приложения, рекомендуется витрина книжного магазина либо приложение для ведения списка
      кинофильмов.<br>
      API для витрины книжного магазина: https://developers.google.com/books/docs/v1/using#request
      Можете выбрать другое приложение CRUD. Готовые rest API найдете здесь: https://github.com/public-apis/public-apis
      Создайте CRUD-приложение с двумя связанными сущностями (например, авторы и книги).
      <ol>
        <p class="mt-1 mb-1">Реализовать страницы:</p>
        <li>список книг</li>
        <li>список авторов</li>
        <li>добавление автора</li>
        <li>добавление книги</li>
        <p class="mt-1 mb-1">Формы:</p>
        <li>добавления книг;</li>
        <li>добавления авторов;</li>
        <li>поиск книг по нескольким параметрам - название, год выпуска, категория, цена</li>
        <p class="mt-1 mb-1">Прочий функционал:</p>
        <li>кнопка удаления книг</li>
      </ol>
      <p class="mt-1 mb-1">Модель автора включает: ФИО, ДР, пол, страну проживания, написанные книги.</p>
      <p class="mt-1 mb-1">Модель книги включает: ISBN, название, автор/список авторов, картинку, краткое описание, теги, цена,
        категория.</p>
    </li>
  </ul>

</template>

<style scoped>

</style>