<script setup></script>

<template>
  <h1 class="mt-5">Урок: «Vue router»</h1>
  <h2>Домашнее задание</h2>
  <p>Добавить тесты к готовому приложению</p>
  <h4>Цель:</h4>

  <p>Разбираться в видах инструментов для тестов, конфигурировать их и писать сами тесты
    Варианты средств расширения vue-приложений; написание плагинов</p>
  <p>Какие скиллы тренируем в ДЗ</p>

  <h4>Описание/Пошаговая инструкция выполнения домашнего задания:</h4>
  <p>Взять приложение из предыдущего ДЗ</p>
  <ul>
    <li>Добавить к нему Vitest</li>
    <li>Написать e2e и unit-тесты как минимум для двух компонентов</li>
  </ul>

  <p>Задачи со звездочкой:</p>
  <ul>
    <li>Добавлен скрипт coverage для просмотра покрытия тестами</li>
    <li>R vitest добавлен coverage-c8</li>
  </ul>
</template>

<style scoped></style>
